БИТУправление_медицинским_центром_демо/src/Catalogs/ЭквайринговыеТерминалы/ЭквайринговыеТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭквайринговыеТерминалы</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыСпособовОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.СоглашенияСтрахования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЭТАвтономно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОповещатьОбОтсутствииНомераСлипЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяТочкаСБП</name>
    <type>
      <types>CatalogRef.НастройкиИнтеграцииСПлатежнымиСистемами</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьПодтверждениеОплатыАвтономногоЭТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючОрганизацииНСПК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНСПК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючКассыНСПК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭквайрингНСПК</name>
    <type>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>ПодключаемоеОборудование</name>
      <type>
        <types>CatalogRef.ПодключаемоеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыСпособовОплат/ТипыСпособовОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСпособовОплат</name>
  <enumValues>
    <name>Эквайринг</name>
  </enumValues>
  <enumValues>
    <name>СБП</name>
  </enumValues>
  <enumValues>
    <name>СертификатНСПК</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ЭквайринговыеТерминалы/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Тип = Перечисления.ТипыСпособовОплат.СертификатНСПК Тогда
		ПроверяемыеРеквизиты.Добавить("ЭквайрингНСПК");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Тип <> Перечисления.ТипыСпособовОплат.Эквайринг Тогда
		ИспользоватьЭТАвтономно = Ложь;
		Оборудование.Очистить();
	КонецЕсли;
	Если Тип <> Перечисления.ТипыСпособовОплат.СБП Тогда
		ТорговаяТочкаСБП = Неопределено;
	КонецЕсли;
	Если Тип <> Перечисления.ТипыСпособовОплат.СертификатНСПК Тогда
		ЭквайрингНСПК = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
